dnd-creator-api/app/controllers/abilities_controller.rb

SELECT "abilities".* FROM "abilities"
---
  def index
    @abilities = Ability.all