dnd-creator-api/app/controllers/char_classes_controller.rb

SELECT "char_classes".* FROM "char_classes"
---
  def index
    @char_classes = CharClass.all