dnd-creator-api/app/controllers/characters_controller.rb

SELECT "characters".* FROM "characters"
---
  def index
    p "Character index route accessed"

    @characters = Character.all

INSERT INTO "characters" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test"], ["created_at", "2020-02-08 15:59:02.313795"], ["updated_at", "2020-02-08 15:59:02.313795"]]
INSERT INTO "characters" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test2"], ["created_at", "2020-02-08 16:20:26.677589"], ["updated_at", "2020-02-08 16:20:26.677589"]]
INSERT INTO "race_joins" ("character_id", "race_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["character_id", 16], ["race_id", 3], ["created_at", "2020-02-08 20:10:03.428493"], ["updated_at", "2020-02-08 20:10:03.428493"]]
INSERT INTO "characters" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test9"], ["created_at", "2020-02-08 16:21:41.187035"], ["updated_at", "2020-02-08 16:21:41.187035"]]
INSERT INTO "class_joins" ("character_id", "char_class_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["character_id", 16], ["char_class_id", 2], ["created_at", "2020-02-08 20:10:03.510899"], ["updated_at", "2020-02-08 20:10:03.510899"]]
---
  def create
    p "Character create route accessed"

    # Is using multiple private params methods appropriate?
    # Is it safe to create directly or should .save be used?
    @character = Character.create(character_params)
    @race_join = @character.race_joins.create(race_joins_params)
    @class_join = @character.class_joins.create(class_joins_params)

DELETE FROM "characters" WHERE "characters"."id" = $1  [["id", 13]]
---
  def destroy
    p "Character destroy route accessed"

    set_character
    render json: @character.destroy()