dnd-creator-api/app/controllers/races_controller.rb

  def index
    @races = Race.all
---
SELECT "races".* FROM "races"